//------------------------------------------------------------------------
// 2025.04.08 STL 화78											 (5주 1일)
// 중간고사 - 4월 24일 목요일 (8주 2일)
// 과제설명 - 4월 10일 목요일
//------------------------------------------------------------------------
// class STRING - STL 정식 컨테이너처럼 동작하는 자료구조
//------------------------------------------------------------------------
// 컴파일 환경은 이렇게 맞춰주세요
// VS 버젼 - 17.3.0 이후
// Release / x64, C++ 언어 표준 - /std::C++latest, SDL검사 - 아니요 
//------------------------------------------------------------------------
#include <iostream>
#include <array>
#include <algorithm>
#include "STRING.h"
#include "save.h"
using namespace std;

extern bool 관찰;

//--------
int main()
//--------
{
	관찰 = true;

	STRING s{ "이동될 문자열" };
	STRING t = move(s);

	cout << s << endl;
	cout << t << endl;

	save("0408.cpp");
}

// for (auto s : a)
//		cout << s << endl;
// 객체가 복사생성되고 소멸을 반복한다
// ->
// for (const STRING& s : a)
//		cout << s << endl;
// 이래야 객체를 생성하지 않는다

//============================================================================================
// 이동 없이 정렬한 결과
// 
//관찰 = true;
//sort(a.begin(), a.end(), [](const STRING& a, const STRING& b) {
//	return a.size() < b.size();
//	});
//관찰 = false;
//
//[6] - 복사생성자           자원수 : 3      주소 : 0x15efaff840, 자원의 주소 : 0x1bdb8bc3580
//[2] - 복사 operator=       자원수 : 3      주소 : 0x15efaff8d8, 자원의 주소 : 0x1bdb8bc3590
//[6] - 소멸자               자원수 : 3      주소 : 0x15efaff840, 자원의 주소 : 0x1bdb8bc3580
//[7] - 복사생성자           자원수 : 5      주소 : 0x15efaff840, 자원의 주소 : 0x1bdb8bc35a0
//[3] - 복사 operator=       자원수 : 5      주소 : 0x15efaff8f0, 자원의 주소 : 0x1bdb8bc3550
//[7] - 소멸자               자원수 : 5      주소 : 0x15efaff840, 자원의 주소 : 0x1bdb8bc35a0
//[8] - 복사생성자           자원수 : 2      주소 : 0x15efaff840, 자원의 주소 : 0x1bdb8bc3510
//[4] - 복사 operator=       자원수 : 5      주소 : 0x15efaff908, 자원의 주소 : 0x1bdb8bc3580
//[3] - 복사 operator=       자원수 : 3      주소 : 0x15efaff8f0, 자원의 주소 : 0x1bdb8bc34d0
//[2] - 복사 operator=       자원수 : 2      주소 : 0x15efaff8d8, 자원의 주소 : 0x1bdb8bc3530
//[8] - 소멸자               자원수 : 2      주소 : 0x15efaff840, 자원의 주소 : 0x1bdb8bc3510
//[9] - 복사생성자           자원수 : 4      주소 : 0x15efaff840, 자원의 주소 : 0x1bdb8bc35a0
//[5] - 복사 operator=       자원수 : 5      주소 : 0x15efaff920, 자원의 주소 : 0x1bdb8bc3450
//[4] - 복사 operator=       자원수 : 4      주소 : 0x15efaff908, 자원의 주소 : 0x1bdb8bc34e0
//[9] - 소멸자               자원수 : 4      주소 : 0x15efaff840, 자원의 주소 : 0x1bdb8bc35a0
//============================================================================================
// 이동 있이 정렬한 결과
// 
//[6] - 이동생성자           자원수 : 3      주소 : 0xd9628ffa80, 자원의 주소 : 0x260082f3530
//[2] - 이동 operator=       자원수 : 3      주소 : 0xd9628ffb18, 자원의 주소 : 0x260082f3530
//[6] - 소멸자               자원수 : 3      주소 : 0xd9628ffa80, 자원의 주소 : 0x0
//[7] - 이동생성자           자원수 : 5      주소 : 0xd9628ffa80, 자원의 주소 : 0x260082f3450
//[3] - 이동 operator=       자원수 : 5      주소 : 0xd9628ffb30, 자원의 주소 : 0x260082f3450
//[7] - 소멸자               자원수 : 5      주소 : 0xd9628ffa80, 자원의 주소 : 0x0
//[8] - 이동생성자           자원수 : 2      주소 : 0xd9628ffa80, 자원의 주소 : 0x260082f3490
//[4] - 이동 operator=       자원수 : 5      주소 : 0xd9628ffb48, 자원의 주소 : 0x260082f3450
//[3] - 이동 operator=       자원수 : 3      주소 : 0xd9628ffb30, 자원의 주소 : 0x260082f3530
//[2] - 이동 operator=       자원수 : 2      주소 : 0xd9628ffb18, 자원의 주소 : 0x260082f3490
//[8] - 소멸자               자원수 : 2      주소 : 0xd9628ffa80, 자원의 주소 : 0x0
//[9] - 이동생성자           자원수 : 4      주소 : 0xd9628ffa80, 자원의 주소 : 0x260082f34b0
//[5] - 이동 operator=       자원수 : 5      주소 : 0xd9628ffb60, 자원의 주소 : 0x260082f3450
//[4] - 이동 operator=       자원수 : 4      주소 : 0xd9628ffb48, 자원의 주소 : 0x260082f34b0
//[9] - 소멸자               자원수 : 4      주소 : 0xd9628ffa80, 자원의 주소 : 0x0
//============================================================================================