//------------------------------------------------------------------------
// 2025.03.06 STL 목23											 (1주 2일)
//------------------------------------------------------------------------
// 강의 소개 / 한 학기 강의를 저장할 수 있는 save 기능 작성
// 과제 - save 기능을 save.cpp로 분리하라
//------------------------------------------------------------------------
// 컴파일 환경은 이렇게 맞춰주세요
// VS 버젼 - 17.3.0 이후
// Release / x64, C++ 언어 표준 - /std::C++latest, SDL검사 - 아니요 
//------------------------------------------------------------------------
#include <iostream>

// [문제] save할 수 있는 코드를 작성하고 실행되게 하라!

void save(std::string_view);

//--------
int main()
//--------
{
	std::cout << "2025 STL 시작" << std::endl;

	save("name.cpp");
}